Revit 2027 API
RoutingPreferenceRule.MEPPartId Property
 The referenced MEPPart (segment or fitting) type in this rule. It may be InvalidElementId if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MEPPartId { get; }
Public ReadOnly Property MEPPartId As ElementId
	Get
public:
property ElementId^ MEPPartId {
	ElementId^ get ();
}
member MEPPartId : ElementId with get
Property Value
ElementId
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace